
## Plan Result

[CI link](https://github.com/hawk0616/recruit-service-board-infla/actions/runs/6277220420)


<pre><code>Plan: 2 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * aws_iam_policy.ssm_get_parameter
  * aws_iam_role_policy_attachment.ecs_task_ssm_get_parameter
* Update
  * aws_ecs_service.ecs_service


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecs_service.ecs_service will be updated in-place
  ~ resource "aws_ecs_service" "ecs_service" {
        id                                 = "arn:aws:ecs:ap-northeast-1:113713103169:service/recruit-service-board/recruit-service-board"
        name                               = "recruit-service-board"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-1:113713103169:task-definition/recruit-service-board:5" -> "arn:aws:ecs:ap-northeast-1:113713103169:task-definition/recruit-service-board:1"
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_iam_policy.ssm_get_parameter will be created
  + resource "aws_iam_policy" "ssm_get_parameter" {
      + arn         = (known after apply)
      + description = "Allows access to SSM GetParameter"
      + id          = (known after apply)
      + name        = "recruit-service-board-ssm-get-parameter"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ssm:GetParameter"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ssm:ap-northeast-1:113713103169:parameter//recruit-service-board/rds/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role_policy_attachment.ecs_task_ssm_get_parameter will be created
  + resource "aws_iam_role_policy_attachment" "ecs_task_ssm_get_parameter" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "recruit-service-board-ecs-task"
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":17,"Program":"tfcmt","SHA1":"1ba7fcd9fdd17e6e62aa06d5128cfa3c69b81f0e","Vars":{},"WorkflowName":"Terraform"} -->